# coding: utf-8
def getbooklist():
    return [ ( '20171221', 'Python 入門邁向高手之路王者歸來', '9789865000592', 699), 
             ( '20180904', 'Python 程式設計入門：金融商管實務案例, 3/e', '9789864343300', 550), 
             ( '20190815', 'Python 最強入門邁向頂尖高手之路：王者歸來 (全彩版)', '9789869807241', 1000),
             ( '20190705', '超圖解 Python 程式設計入門', '9789863125952', 650),
             ( '20161229', 'Python 自動化的樂趣｜搞定重複瑣碎 & 單調無聊的工作 (中文版)', '9789864762729', 500),
             ( '20190325', 'Python零基礎入門班(第二版)：一次打好程式設計、運算思維與邏輯訓練基本功！', '9789865020798', 390),
             ( '20190806', '秋聲教你玩Python：給挑戰者的修行之路', '9789864344147', 450),
             ( '20161102', 'Python 程式設計「超入門」', '9789863123798', 420),
             ( '20160630', 'Python 程式設計入門指南', '9789864760527', 520),
             ( '20170421', '學會 Python：從不懂，到玩上手！', '9789863124245', 550), 
           ]    
